src/cf/Catalogs/БанковскиеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>БанковскиеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.Организации</xr:Item>
				<xr:Item>Catalog.ФизическиеЛица</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Comment>Номер расчетного счета</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИДатаРазрешения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Comment>Дата открытия счета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Comment>Дата закрытия счета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанкДляРасчетов</Name>
					<Comment>Банк, в случае непрямых расчетов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСчета</Name>
					<Comment>Расчетный, депозитный, ссудный, иной</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстКорреспондента</Name>
					<Comment>Текст "Плательщик\Получатель" в платежных документах</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстНазначения</Name>
					<Comment>Текст назначения платежа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцПрописью</Name>
					<Comment>Указывать в дате документа месяц прописью</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБезКопеек</Name>
					<Comment>Указывать сумму без копеек, если она в целых рублях</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегдаУказыватьКПП</Name>
					<Comment>Всегда указывать КПП в платежных документах</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосударственныйКонтракт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГосКонтракты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКорпоративныхРасчетов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетБанк</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыпискаЗагружаетсяПоДепозитномуСчету</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦифровойСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/ИнтеграцияАУСНПереопределяемый/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает организацию по умолчанию
// 
// Параметры:
//   ОсновнаяОрганизация - ОпределяемыйТип.Организация, Неопределено - (возвращаемое значение)
//  
Процедура ПолучитьОсновнуюОрганизацию(ОсновнаяОрганизация) Экспорт
	
	ОсновнаяОрганизация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	
КонецПроцедуры

// Возвращает сведения об организации.
//
// Параметры:
//  Организация - ОпределяемыйТип.Организация - ссылка на элемент справочника Организации
//  НачалоПериода - Дата, Неопределено - начало периода настроек
//  КонецПериода - Дата, Неопределено - конец периода настроек
//  СведенияОбОрганизации - Структура - см. ИнтеграцияАУСН.НовыеСведенияОбОрганизации (возвращаемое значение)
//
Процедура ПолучитьСведенияОбОрганизации(Организация, НачалоПериода, КонецПериода, СведенияОбОрганизации) Экспорт
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, "ИНН");
	
	ИспользуетсяНесколькоБанковскихСчетов = Справочники.БанковскиеСчета.ИспользуетсяНесколькоБанковскихСчетовОрганизации(
		Организация);
		
	//@skip-check wrong-string-literal-content
	ОсновнойБанковскийСчет = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ОсновнойБанковскийСчет");
	Если ЗначениеЗаполнено(ОсновнойБанковскийСчет) Тогда
		//@skip-check wrong-string-literal-content
		БИК = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОсновнойБанковскийСчет, "Банк.Код");
		БанкОсновногоСчета = РаботаСБанкамиБП.СсылкаПоКлассификатору(БИК);
		Если БанкОсновногоСчета = Неопределено Тогда
			БанкОсновногоСчета = Справочники.КлассификаторБанков.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
	БанкиОрганизации = Новый Массив;
	
	БанковскиеСчетаОрганизации = Справочники.БанковскиеСчета.БанковскиеСчетаОрганизации(
		Организация, ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета(), , Ложь);
	Если ЗначениеЗаполнено(БанковскиеСчетаОрганизации) Тогда
		РеквизитыБанковскихСчетов = Справочники.БанковскиеСчета.РеквизитыБанковскихСчетов(
			ОбщегоНазначения.ВыгрузитьКолонку(БанковскиеСчетаОрганизации, "Ссылка"));
		Для Каждого РеквизитыСчета Из РеквизитыБанковскихСчетов Цикл
			Если ЗначениеЗаполнено(НачалоПериода) И ЗначениеЗаполнено(РеквизитыСчета.ДатаЗакрытия)
				И РеквизитыСчета.ДатаЗакрытия < НачалоПериода Тогда
				Продолжить;
			КонецЕсли;
			Если ЗначениеЗаполнено(КонецПериода) И ЗначениеЗаполнено(РеквизитыСчета.ДатаОткрытия)
				И КонецПериода < РеквизитыСчета.ДатаОткрытия Тогда
				Продолжить;
			КонецЕсли;
			БанкСчета = РаботаСБанкамиБП.СсылкаПоКлассификатору(РеквизитыСчета.БанкКод);
			Если БанкСчета <> Неопределено И БанкиОрганизации.Найти(БанкСчета) = Неопределено Тогда
				БанкиОрганизации.Добавить(БанкСчета);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НачалоПериода) И ЗначениеЗаполнено(КонецПериода) Тогда
		ПрименяетсяАУСН = УчетнаяПолитика.ПрименяетсяАУСНЗаПериод(
			Организация, НачалоПериода, КонецПериода);
	Иначе
		ПрименяетсяАУСН = УчетнаяПолитика.ПрименяетсяАУСН(
			Организация, ТекущаяДатаСеанса());
	КонецЕсли;
	
	ПредставлениеСистемыНалогообложения = ОрганизацииФормыКлиентСервер.ПредставлениеСистемыНалогообложения(Организация);
	
	СведенияОбОрганизации = ИнтеграцияАУСН.НовыеСведенияОбОрганизации();
	СведенияОбОрганизации.Вставить("ИНН", РеквизитыОрганизации.ИНН);
	СведенияОбОрганизации.Вставить("ИспользуетсяНесколькоБанковскихСчетов", ИспользуетсяНесколькоБанковскихСчетов);
	СведенияОбОрганизации.Вставить("БанкОсновногоСчета", БанкОсновногоСчета);
	СведенияОбОрганизации.Вставить("БанкиОрганизации", БанкиОрганизации);
	СведенияОбОрганизации.Вставить("ПрименяетсяАУСН", ПрименяетсяАУСН);
	СведенияОбОрганизации.Вставить("ПредставлениеСистемыНалогообложения", ПредставлениеСистемыНалогообложения);
	
КонецПроцедуры

#КонецОбласти
